In [1]:
import pandas as pd
import os
import json
import glob
import re
from pandasql import sqldf

In [2]:
files = glob.glob('data/retail_db/orders/part**')
orders_file = '/'.join(re.split('[/\\\]',files[0]))
orders_file

'data/retail_db/orders/part-00000'

In [3]:
orders = pd.read_csv(orders_file, names=['order_id', 'order_date', 'order_customer_id', 'order_status'])

In [10]:
data = [(1, 'Ramesh', 32, 'Ahmedabad', 2000.00),
(2, 'Khilan', 25, 'Delhi', 1500.00),
(3, 'kaushik', 23, 'Kota', 2000.00),
(4, 'Chaitali', 25, 'Mumbai', 6500.00),
(5, 'Hardik', 27, 'Bhopal', 8500.00),
(6, 'Komal', 22, 'MP', 4500.00),
(7, 'Muffy', 24, 'Indore', 10000.00)]

df = pd.DataFrame(data,columns=['id','name','age','address','salary'])

In [11]:
#where condition in pandas
df.head()

   id      name  age    address  salary
0   1    Ramesh   32  Ahmedabad  2000.0
1   2    Khilan   25      Delhi  1500.0
2   3   kaushik   23       Kota  2000.0
3   4  Chaitali   25     Mumbai  6500.0
4   5    Hardik   27     Bhopal  8500.0

In [19]:
#where condition in pandas
df.isin([3,'kaushik',33])

      id   name    age  address  salary
0  False  False  False    False   False
1  False  False  False    False   False
2   True   True  False    False   False
3  False  False  False    False   False
4  False  False  False    False   False
5  False  False  False    False   False
6  False  False  False    False   False

In [24]:
# pandas.DataFram.where
#mask
age_series = df['age']
print(type(age_series))
age_series
t = pd.Series([True,False])
t

<class 'pandas.core.series.Series'>

0     True
1    False
dtype: bool

In [36]:
m = df['age'] ==23
print(m)
df.where(m, df) == df.mask(m,df)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: age, dtype: bool

     id  name   age  address  salary
0  True  True  True     True    True
1  True  True  True     True    True
2  True  True  True     True    True
3  True  True  True     True    True
4  True  True  True     True    True
5  True  True  True     True    True
6  True  True  True     True    True

In [40]:
#selecting multiple values of a column
df1 = df.loc[df.age.isin([25,32])]
df1

   id      name  age    address  salary
0   1    Ramesh   32  Ahmedabad  2000.0
1   2    Khilan   25      Delhi  1500.0
3   4  Chaitali   25     Mumbai  6500.0

In [43]:
# not in list
df2 = df[~(df.age.isin([25,32]))]
df2

   id     name  age address   salary
2   3  kaushik   23    Kota   2000.0
4   5   Hardik   27  Bhopal   8500.0
5   6    Komal   22      MP   4500.0
6   7    Muffy   24  Indore  10000.0

In [56]:
# where clause with AND= & and OR operator.
df3 = df[((df.age == 23)) | (df.salary < 4500) & (df.name == 'kaushik')]
df3

   id     name  age address  salary
2   3  kaushik   23    Kota  2000.0

In [39]:
df.query('age == 25 & salary < 4500')

   id    name  age address  salary
1   2  Khilan   25   Delhi  1500.0

In [59]:
# Pandas match rows ending with text
df[df.name.str.startswith('K',na=False)]

   id    name  age address  salary
1   2  Khilan   25   Delhi  1500.0
5   6   Komal   22      MP  4500.0

In [63]:
# Pandas match rows ending with text
df[df.name.str.endswith('k',na=False)]

   id     name  age address  salary
2   3  kaushik   23    Kota  2000.0
4   5   Hardik   27  Bhopal  8500.0

In [66]:
# Pandas Like operator with Query
print(df[df.name.str.contains("i")])
df.query('name.str.contains("e")', engine = 'python')

   id      name  age address  salary
1   2    Khilan   25   Delhi  1500.0
2   3   kaushik   23    Kota  2000.0
3   4  Chaitali   25  Mumbai  6500.0
4   5    Hardik   27  Bhopal  8500.0

   id    name  age    address  salary
0   1  Ramesh   32  Ahmedabad  2000.0

In [68]:
# !pip show pandas

In [72]:
# Lambda Method for filtering

newdf = df[df.apply(lambda x:x['name'] == 'Hardik' and x['address'] == 'Bhopal',axis=1)]
newdf

   id    name  age address  salary
4   5  Hardik   27  Bhopal  8500.0

In [73]:
# Get top records from dataframe. here we are using top 2 records.
df.head(2)

   id    name  age    address  salary
0   1  Ramesh   32  Ahmedabad  2000.0
1   2  Khilan   25      Delhi  1500.0

In [80]:
# Find Distinct values in pandas dataframe column
print(df['salary'].unique())
len(df['salary'].unique())

[ 2000.  1500.  6500.  8500.  4500. 10000.]

6

In [84]:
# Sorting or order by dataframe in ascending or decending.
print(df.sort_values(by=['age'],ascending=True))
df.sort_values(by=['age'],ascending=False)

   id      name  age    address   salary
5   6     Komal   22         MP   4500.0
2   3   kaushik   23       Kota   2000.0
6   7     Muffy   24     Indore  10000.0
1   2    Khilan   25      Delhi   1500.0
3   4  Chaitali   25     Mumbai   6500.0
4   5    Hardik   27     Bhopal   8500.0
0   1    Ramesh   32  Ahmedabad   2000.0

   id      name  age    address   salary
0   1    Ramesh   32  Ahmedabad   2000.0
4   5    Hardik   27     Bhopal   8500.0
1   2    Khilan   25      Delhi   1500.0
3   4  Chaitali   25     Mumbai   6500.0
6   7     Muffy   24     Indore  10000.0
2   3   kaushik   23       Kota   2000.0
5   6     Komal   22         MP   4500.0